espressif/arduino-esp32/cores/esp32/esp32-hal-adc.c
// Copyright 2015-2023 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at

//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include "esp32-hal-adc.h"

#if SOC_ADC_SUPPORTED
#include "esp32-hal.h"
#include "esp32-hal-periman.h"
#include "esp_adc/adc_oneshot.h"
#include "esp_adc/adc_continuous.h"
#include "esp_adc/adc_cali_scheme.h"
#include "esp_heap_caps.h"

#if CONFIG_IDF_TARGET_ESP32P4 && CONFIG_ESP32P4_REV_MIN_FULL >= 300
// NOTE: These weak definitions allow successful linkage if the real efuse calibration functions are missing.
// This is a workaround for the ESP32P4 rev 3.0+, which is missing efuse calibration functions in the IDF.
__attribute__((weak)) uint32_t esp_efuse_rtc_calib_get_ver(void) {
  return 0;
}

__attribute__((weak)) uint32_t esp_efuse_rtc_calib_get_init_code(uint32_t atten, uint32_t *code) {
  if (code) {
    *code = 0;
  }
  return 0;  // 0 means success in ESP-IDF conventions
}

__attribute__((weak)) uint32_t esp_efuse_rtc_calib_get_chan_compens(uint32_t atten, uint32_t *comp) {
  if (comp) {
    *comp = 0;
  }
  return 0;
}

__attribute__((weak)) uint32_t esp_efuse_rtc_calib_get_cal_voltage(uint32_t atten, uint32_t *voltage) {
  if (voltage) {
    *voltage = 0;
  }
  return 0;
}
#endif

// ESP32-C2 does not define those two for some reason
#ifndef SOC_ADC_DIGI_RESULT_BYTES
#define SOC_ADC_DIGI_RESULT_BYTES (4)
#endif
#ifndef SOC_ADC_DIGI_DATA_BYTES_PER_CONV
#define SOC_ADC_DIGI_DATA_BYTES_PER_CONV (4)
#endif

static uint8_t __analogAttenuation = ADC_11db;
static uint8_t __analogWidth = SOC_ADC_RTC_MAX_BITWIDTH;
static uint8_t __analogReturnedWidth = SOC_ADC_RTC_MAX_BITWIDTH;

typedef struct {
  voidFuncPtr fn;
  void *arg;
} interrupt_config_t;

typedef struct {
  adc_oneshot_unit_handle_t adc_oneshot_handle;
  adc_continuous_handle_t adc_continuous_handle;
  interrupt_config_t adc_interrupt_handle;
  adc_cali_handle_t adc_cali_handle;
  uint32_t buffer_size;
  uint32_t conversion_frame_size;
} adc_handle_t;

adc_handle_t adc_handle[SOC_ADC_PERIPH_NUM];

static bool adcDetachBus(void *pin) {
  adc_channel_t adc_channel;
  adc_unit_t adc_unit;
  uint8_t used_channels = 0;

  adc_oneshot_io_to_channel((int)(pin - 1), &adc_unit, &adc_channel);
  for (uint8_t channel = 0; channel < SOC_ADC_CHANNEL_NUM(adc_unit); channel++) {
    int io_pin;
    adc_oneshot_channel_to_io(adc_unit, channel, &io_pin);
    if (perimanGetPinBusType(io_pin) == ESP32_BUS_TYPE_ADC_ONESHOT) {
      used_channels++;
    }
  }

  if (used_channels == 1) {  //only 1 channel is used
    esp_err_t err = adc_oneshot_del_unit(adc_handle[adc_unit].adc_oneshot_handle);
    if (err != ESP_OK) {
      return false;
    }
    adc_handle[adc_unit].adc_oneshot_handle = NULL;
    if (adc_handle[adc_unit].adc_cali_handle != NULL) {
#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
      err = adc_cali_delete_scheme_curve_fitting(adc_handle[adc_unit].adc_cali_handle);
      if (err != ESP_OK) {
        return false;
      }
#elif ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
      err = adc_cali_delete_scheme_line_fitting(adc_handle[adc_unit].adc_cali_handle);
      if (err != ESP_OK) {
        return false;
      }
#else
      log_e("ADC Calibration scheme is not supported!");
      return false;
#endif
    }
    adc_handle[adc_unit].adc_cali_handle = NULL;
  }
  return true;
}

esp_err_t __analogChannelConfig(adc_bitwidth_t width, adc_attenuation_t atten, int8_t pin) {
  esp_err_t err = ESP_OK;
  adc_oneshot_chan_cfg_t config = {
    .bitwidth = width,
    .atten = (atten & 3),
  };
  if (pin == -1) {  //Reconfigure all used analog pins/channels
    for (int adc_unit = 0; adc_unit < SOC_ADC_PERIPH_NUM; adc_unit++) {
      if (adc_handle[adc_unit].adc_oneshot_handle != NULL) {
        for (uint8_t channel = 0; channel < SOC_ADC_CHANNEL_NUM(adc_unit); channel++) {
          int io_pin;
          adc_oneshot_channel_to_io(adc_unit, channel, &io_pin);
          if (perimanGetPinBusType(io_pin) == ESP32_BUS_TYPE_ADC_ONESHOT) {
            err = adc_oneshot_config_channel(adc_handle[adc_unit].adc_oneshot_handle, channel, &config);
            if (err != ESP_OK) {
              log_e("adc_oneshot_config_channel failed with error: %d", err);
              return err;
            }
          }
        }
        //ADC calibration reconfig only if all channels are updated
        if (adc_handle[adc_unit].adc_cali_handle != NULL) {
#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
          log_d("Deleting ADC_UNIT_%d cali handle", adc_unit);
          err = adc_cali_delete_scheme_curve_fitting(adc_handle[adc_unit].adc_cali_handle);
          if (err != ESP_OK) {
            log_e("adc_cali_delete_scheme_curve_fitting failed with error: %d", err);
            return err;
          }
          adc_cali_curve_fitting_config_t cali_config = {
            .unit_id = adc_unit,
            .atten = atten,
            .bitwidth = width,
          };
          log_d("Creating ADC_UNIT_%d curve cali handle", adc_unit);
          err = adc_cali_create_scheme_curve_fitting(&cali_config, &adc_handle[adc_unit].adc_cali_handle);
          if (err != ESP_OK) {
            log_e("adc_cali_create_scheme_curve_fitting failed with error: %d", err);
            return err;
          }
#elif ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
          log_d("Deleting ADC_UNIT_%d line cali handle", adc_unit);
          err = adc_cali_delete_scheme_line_fitting(adc_handle[adc_unit].adc_cali_handle);
          if (err != ESP_OK) {
            log_e("adc_cali_delete_scheme_line_fitting failed with error: %d", err);
            return err;
          }
          adc_cali_line_fitting_config_t cali_config = {
            .unit_id = adc_unit,
            .atten = atten,
            .bitwidth = width,
          };
          log_d("Creating ADC_UNIT_%d line cali handle", adc_unit);
          err = adc_cali_create_scheme_line_fitting(&cali_config, &adc_handle[adc_unit].adc_cali_handle);
          if (err != ESP_OK) {
            log_e("adc_cali_create_scheme_line_fitting failed with error: %d", err);
            return err;
          }
#else
          log_e("ADC Calibration scheme is not supported!");
          return ESP_ERR_NOT_SUPPORTED;
#endif
        }
      }
    }

    //make it default for next channels
    __analogWidth = width;
    __analogAttenuation = atten;
  } else {  //Reconfigure single channel
    if (perimanGetPinBusType(pin) == ESP32_BUS_TYPE_ADC_ONESHOT) {
      adc_channel_t channel;
      adc_unit_t adc_unit;

      adc_oneshot_io_to_channel(pin, &adc_unit, &channel);
      if (err != ESP_OK) {
        log_e("Pin %u is not ADC pin!", pin);
        return err;
      }
      err = adc_oneshot_config_channel(adc_handle[adc_unit].adc_oneshot_handle, channel, &config);
      if (err != ESP_OK) {
        log_e("adc_oneshot_config_channel failed with error: %d", err);
        return err;
      }
    } else {
      log_e("Pin is not configured as analog channel");
    }
  }
  return ESP_OK;
}

static inline uint16_t mapResolution(uint16_t value) {
  uint8_t from = __analogWidth;
  if (from == __analogReturnedWidth) {
    return value;
  }
  if (from > __analogReturnedWidth) {
    return value >> (from - __analogReturnedWidth);
  }
  return value << (__analogReturnedWidth - from);
}

void __analogSetAttenuation(adc_attenuation_t attenuation) {
  if (__analogChannelConfig(__analogWidth, attenuation, -1) != ESP_OK) {
    log_e("__analogChannelConfig failed!");
  }
}

#if CONFIG_IDF_TARGET_ESP32
void __analogSetWidth(uint8_t bits) {
  if (bits < SOC_ADC_RTC_MIN_BITWIDTH) {
    bits = SOC_ADC_RTC_MIN_BITWIDTH;
  } else if (bits > SOC_ADC_RTC_MAX_BITWIDTH) {
    bits = SOC_ADC_RTC_MAX_BITWIDTH;
  }
  if (__analogChannelConfig(bits, __analogAttenuation, -1) != ESP_OK) {
    log_e("__analogChannelConfig failed!");
  }
}
#endif

