espressif/arduino-esp32/cores/esp32/esp32-hal-adc.c
esp_err_t __analogInit(uint8_t pin, adc_channel_t channel, adc_unit_t adc_unit) {
  esp_err_t err = ESP_OK;
  if (adc_handle[adc_unit].adc_oneshot_handle == NULL) {
    adc_oneshot_unit_init_cfg_t init_config1 = {
      .unit_id = adc_unit,
      .ulp_mode = ADC_ULP_MODE_DISABLE,
    };
    err = adc_oneshot_new_unit(&init_config1, &adc_handle[adc_unit].adc_oneshot_handle);

    if (err != ESP_OK) {
      log_e("adc_oneshot_new_unit failed with error: %d", err);
      return err;
    }
  }
  perimanSetBusDeinit(ESP32_BUS_TYPE_ADC_ONESHOT, adcDetachBus);

  if (!perimanSetPinBus(pin, ESP32_BUS_TYPE_ADC_ONESHOT, (void *)(pin + 1), adc_unit, channel)) {
    adcDetachBus((void *)(pin + 1));
    return err;
  }

  adc_oneshot_chan_cfg_t config = {
    .bitwidth = __analogWidth,
    .atten = __analogAttenuation,
  };

  err = adc_oneshot_config_channel(adc_handle[adc_unit].adc_oneshot_handle, channel, &config);
  if (err != ESP_OK) {
    log_e("adc_oneshot_config_channel failed with error: %d", err);
    return err;
  }
  return ESP_OK;
}

void __analogSetPinAttenuation(uint8_t pin, adc_attenuation_t attenuation) {
  if (__analogChannelConfig(__analogWidth, attenuation, pin) != ESP_OK) {
    log_e("__analogChannelConfig failed!");
  }
}

void __analogReadResolution(uint8_t bits) {
  if (!bits || bits > 16) {
    return;
  }
  __analogReturnedWidth = bits;

#if CONFIG_IDF_TARGET_ESP32
  __analogSetWidth(bits);  // hardware analog resolution from 9 to 12
#endif
}

uint16_t __analogRead(uint8_t pin) {
  int value = 0;
  adc_channel_t channel;
  adc_unit_t adc_unit;

  esp_err_t err = ESP_OK;
  err = adc_oneshot_io_to_channel(pin, &adc_unit, &channel);
  if (err != ESP_OK) {
    log_e("Pin %u is not ADC pin!", pin);
    return value;
  }

  if (perimanGetPinBus(pin, ESP32_BUS_TYPE_ADC_ONESHOT) == NULL) {
    log_d("Calling __analogInit! pin = %u", pin);
    err = __analogInit(pin, channel, adc_unit);
    if (err != ESP_OK) {
      log_e("Analog initialization failed!");
      return value;
    }
  }

  adc_oneshot_read(adc_handle[adc_unit].adc_oneshot_handle, channel, &value);
  return mapResolution(value);
}

uint32_t __analogReadMilliVolts(uint8_t pin) {
  int value = 0;
  adc_channel_t channel;
  adc_unit_t adc_unit;
  esp_err_t err = ESP_OK;

  adc_oneshot_io_to_channel(pin, &adc_unit, &channel);
  if (err != ESP_OK) {
    log_e("Pin %u is not ADC pin!", pin);
    return value;
  }

  if (perimanGetPinBus(pin, ESP32_BUS_TYPE_ADC_ONESHOT) == NULL) {
    err = __analogInit(pin, channel, adc_unit);
    if (err != ESP_OK) {
      log_e("Analog initialization failed!");
      return value;
    }
  }

  if (adc_handle[adc_unit].adc_cali_handle == NULL) {
    log_d("Creating cali handle for ADC_%d", adc_unit);
#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
    adc_cali_curve_fitting_config_t cali_config = {
      .unit_id = adc_unit,
      .atten = __analogAttenuation,
      .bitwidth = __analogWidth,
    };
    err = adc_cali_create_scheme_curve_fitting(&cali_config, &adc_handle[adc_unit].adc_cali_handle);
#elif ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
    adc_cali_line_fitting_config_t cali_config = {
      .unit_id = adc_unit,
      .bitwidth = __analogWidth,
      .atten = __analogAttenuation,
    };
    err = adc_cali_create_scheme_line_fitting(&cali_config, &adc_handle[adc_unit].adc_cali_handle);
#else
    log_e("ADC Calibration scheme is not supported!");
    return value;
#endif
    if (err != ESP_OK) {
      log_e("adc_cali_create_scheme_x failed!");
      return value;
    }
  }

  err = adc_oneshot_get_calibrated_result(adc_handle[adc_unit].adc_oneshot_handle, adc_handle[adc_unit].adc_cali_handle, channel, &value);
  if (err != ESP_OK) {
    log_e("adc_oneshot_get_calibrated_result failed!");
    return 0;
  }
  return value;
}

extern uint16_t analogRead(uint8_t pin) __attribute__((weak, alias("__analogRead")));
extern uint32_t analogReadMilliVolts(uint8_t pin) __attribute__((weak, alias("__analogReadMilliVolts")));
extern void analogReadResolution(uint8_t bits) __attribute__((weak, alias("__analogReadResolution")));
extern void analogSetAttenuation(adc_attenuation_t attenuation) __attribute__((weak, alias("__analogSetAttenuation")));
extern void analogSetPinAttenuation(uint8_t pin, adc_attenuation_t attenuation) __attribute__((weak, alias("__analogSetPinAttenuation")));

#if CONFIG_IDF_TARGET_ESP32
extern void analogSetWidth(uint8_t bits) __attribute__((weak, alias("__analogSetWidth")));
#endif

/*
 *  ADC Continuous mode
 */

#if CONFIG_IDF_TARGET_ESP32 || CONFIG_IDF_TARGET_ESP32S2
#define ADC_OUTPUT_TYPE         ADC_DIGI_OUTPUT_FORMAT_TYPE1
#define ADC_GET_CHANNEL(p_data) ((p_data)->type1.channel)
#define ADC_GET_DATA(p_data)    ((p_data)->type1.data)
#else
#define ADC_OUTPUT_TYPE         ADC_DIGI_OUTPUT_FORMAT_TYPE2
#define ADC_GET_CHANNEL(p_data) ((p_data)->type2.channel)
#define ADC_GET_DATA(p_data)    ((p_data)->type2.data)
#endif

static uint8_t __adcContinuousAtten = ADC_11db;
static uint8_t __adcContinuousWidth = SOC_ADC_DIGI_MAX_BITWIDTH;

static uint8_t used_adc_channels = 0;
adc_continuous_result_t *adc_result = NULL;

static bool adcContinuousDetachBus(void *adc_unit_number) {
  adc_unit_t adc_unit = (adc_unit_t)adc_unit_number - 1;

  // Guard against double-cleanup: check if already cleaned up
  if (adc_handle[adc_unit].adc_continuous_handle == NULL) {
    return true;
  }

  // Clean up ADC driver
  esp_err_t err = adc_continuous_deinit(adc_handle[adc_unit].adc_continuous_handle);
  if (err != ESP_OK) {
    return false;
  }
  adc_handle[adc_unit].adc_continuous_handle = NULL;

  // Clean up calibration handle if exists
  if (adc_handle[adc_unit].adc_cali_handle != NULL) {
#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
    err = adc_cali_delete_scheme_curve_fitting(adc_handle[adc_unit].adc_cali_handle);
    if (err != ESP_OK) {
      return false;
    }
#elif ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
    err = adc_cali_delete_scheme_line_fitting(adc_handle[adc_unit].adc_cali_handle);
    if (err != ESP_OK) {
      return false;
    }
#else
    log_e("ADC Calibration scheme is not supported!");
    return false;
#endif
    adc_handle[adc_unit].adc_cali_handle = NULL;
  }

