espressif/arduino-esp32/cores/esp32/esp32-hal-adc.c
  // Don't call perimanClearPinBus() here - the peripheral manager already handles it.
  // This callback is only responsible for cleaning up the IDF's ADC driver and calibration handles.
  // It does NOT free the adc_result buffer. The caller is responsible for freeing adc_result.
  return true;
}

bool IRAM_ATTR adcFnWrapper(adc_continuous_handle_t handle, const adc_continuous_evt_data_t *edata, void *args) {
  interrupt_config_t *isr = (interrupt_config_t *)args;
  //Check if edata->size matches conversion_frame_size, else just return from ISR
  if (edata->size == adc_handle[0].conversion_frame_size) {
    if (isr->fn) {
      if (isr->arg) {
        ((voidFuncPtrArg)isr->fn)(isr->arg);
      } else {
        isr->fn();
      }
    }
  }
  return false;
}

esp_err_t __analogContinuousInit(adc_channel_t *channel, uint8_t channel_num, adc_unit_t adc_unit, uint32_t sampling_freq_hz) {
  //Create new ADC continuous handle
  adc_continuous_handle_cfg_t adc_config = {
    .max_store_buf_size = adc_handle[adc_unit].buffer_size,
    .conv_frame_size = adc_handle[adc_unit].conversion_frame_size,
  };

  esp_err_t err = adc_continuous_new_handle(&adc_config, &adc_handle[adc_unit].adc_continuous_handle);
  if (err != ESP_OK) {
    log_e("adc_continuous_new_handle failed with error: %d", err);
    return ESP_FAIL;
  }

  //Configure adc pins
  adc_continuous_config_t dig_cfg = {
    .sample_freq_hz = sampling_freq_hz,
    .conv_mode = ADC_CONV_SINGLE_UNIT_1,
    .format = ADC_OUTPUT_TYPE,
  };
  adc_digi_pattern_config_t adc_pattern[SOC_ADC_PATT_LEN_MAX] = {0};
  dig_cfg.pattern_num = channel_num;
  for (int i = 0; i < channel_num; i++) {
    adc_pattern[i].atten = __adcContinuousAtten;
    adc_pattern[i].channel = channel[i];
    adc_pattern[i].unit = ADC_UNIT_1;
    adc_pattern[i].bit_width = __adcContinuousWidth;
  }
  dig_cfg.adc_pattern = adc_pattern;
  err = adc_continuous_config(adc_handle[adc_unit].adc_continuous_handle, &dig_cfg);

  if (err != ESP_OK) {
    log_e("adc_continuous_config failed with error: %d", err);
    return ESP_FAIL;
  }

  used_adc_channels = channel_num;
  return ESP_OK;
}

bool analogContinuous(const uint8_t pins[], size_t pins_count, uint32_t conversions_per_pin, uint32_t sampling_freq_hz, void (*userFunc)(void)) {
  adc_channel_t channel[pins_count];
  adc_unit_t adc_unit = ADC_UNIT_1;
  esp_err_t err = ESP_OK;

  //Convert pins to channels and check if all are ADC1s unit
  for (int i = 0; i < pins_count; i++) {
    err = adc_continuous_io_to_channel(pins[i], &adc_unit, &channel[i]);
    if (err != ESP_OK) {
      log_e("Pin %u is not ADC pin!", pins[i]);
      return false;
    }
    if (adc_unit != 0) {
      log_e("Only ADC1 pins are supported in continuous mode!");
      return false;
    }
  }

  //Check if Oneshot and Continuous handle exists
  if (adc_handle[adc_unit].adc_oneshot_handle != NULL) {
    log_e("ADC%d is running in oneshot mode. Aborting.", adc_unit + 1);
    return false;
  }
  if (adc_handle[adc_unit].adc_continuous_handle != NULL) {
    log_e("ADC%d continuous is already initialized. To reconfigure call analogContinuousDeinit() first.", adc_unit + 1);
    return false;
  }

  //Check sampling frequency
  if ((sampling_freq_hz < SOC_ADC_SAMPLE_FREQ_THRES_LOW) || (sampling_freq_hz > SOC_ADC_SAMPLE_FREQ_THRES_HIGH)) {
    log_e("Sampling frequency is out of range. Supported sampling frequencies are %d - %d", SOC_ADC_SAMPLE_FREQ_THRES_LOW, SOC_ADC_SAMPLE_FREQ_THRES_HIGH);
    return false;
  }

  //Set periman deinit function and reset all pins to init state.
  perimanSetBusDeinit(ESP32_BUS_TYPE_ADC_CONT, adcContinuousDetachBus);
  for (int j = 0; j < pins_count; j++) {
    if (!perimanClearPinBus(pins[j])) {
      return false;
    }
  }

  //Set conversion frame and buffer size (conversion frame must be in multiples of SOC_ADC_DIGI_DATA_BYTES_PER_CONV)
  adc_handle[adc_unit].conversion_frame_size = conversions_per_pin * pins_count * SOC_ADC_DIGI_RESULT_BYTES;

#if CONFIG_IDF_TARGET_ESP32 || CONFIG_IDF_TARGET_ESP32S2
  uint8_t calc_multiple = adc_handle[adc_unit].conversion_frame_size % SOC_ADC_DIGI_DATA_BYTES_PER_CONV;
  if (calc_multiple != 0) {
    adc_handle[adc_unit].conversion_frame_size = (adc_handle[adc_unit].conversion_frame_size + calc_multiple);
  }
#endif

  // Align the conversion frame size to the DMA alignment boundary so that
  // cache-coherency is maintained (e.g. L2 cache on ESP32-P4 = CONFIG_CACHE_L2_CACHE_LINE_SIZE).
  uint32_t alignment_remainder = adc_handle[adc_unit].conversion_frame_size % ESP_ARDUINO_DMA_BUF_ALIGN;
  if (alignment_remainder != 0) {
    __attribute__((unused)) uint32_t original_size = adc_handle[adc_unit].conversion_frame_size;
    adc_handle[adc_unit].conversion_frame_size += (ESP_ARDUINO_DMA_BUF_ALIGN - alignment_remainder);
    log_w(
      "ADC conversion frame size rounded up from %" PRIu32 " to %" PRIu32 " bytes to meet DMA alignment (%u bytes). "
      "Effective conversions per frame may differ from requested. "
      "Consider using a frame size that is a multiple of %u bytes to avoid automatic rounding.",
      original_size, adc_handle[adc_unit].conversion_frame_size, ESP_ARDUINO_DMA_BUF_ALIGN, ESP_ARDUINO_DMA_BUF_ALIGN
    );
  }

  adc_handle[adc_unit].buffer_size = adc_handle[adc_unit].conversion_frame_size * 2;

  //Conversion frame size buffer cant be bigger than 4092 bytes
  if (adc_handle[adc_unit].conversion_frame_size > 4092) {
    log_e("Buffers are too big. Please set lower conversions per pin.");
    return false;
  }

  //Initialize continuous handle and pins
  err = __analogContinuousInit(channel, sizeof(channel) / sizeof(adc_channel_t), adc_unit, sampling_freq_hz);
  if (err != ESP_OK) {
    log_e("Analog initialization failed!");
    return false;
  }

  //Setup callbacks for complete event
  adc_continuous_evt_cbs_t cbs = {
    .on_conv_done = adcFnWrapper,
    //.on_pool_ovf can be used in future
  };
  adc_handle[adc_unit].adc_interrupt_handle.fn = (voidFuncPtr)userFunc;
  err = adc_continuous_register_event_callbacks(adc_handle[adc_unit].adc_continuous_handle, &cbs, &adc_handle[adc_unit].adc_interrupt_handle);
  if (err != ESP_OK) {
    log_e("adc_continuous_register_event_callbacks failed!");
    return false;
  }

  //Allocate and prepare result structure for adc readings
  adc_result = malloc(pins_count * sizeof(adc_continuous_result_t));
  for (int k = 0; k < pins_count; k++) {
    adc_result[k].pin = pins[k];
    adc_result[k].channel = channel[k];
  }

  //Initialize ADC calibration handle
  if (adc_handle[adc_unit].adc_cali_handle == NULL) {
    log_d("Creating cali handle for ADC_%d", adc_unit);
#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
    adc_cali_curve_fitting_config_t cali_config = {
      .unit_id = adc_unit,
      .atten = __adcContinuousAtten,
      .bitwidth = __adcContinuousWidth,
    };
    err = adc_cali_create_scheme_curve_fitting(&cali_config, &adc_handle[adc_unit].adc_cali_handle);
#elif ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
    adc_cali_line_fitting_config_t cali_config = {
      .unit_id = adc_unit,
      .bitwidth = __adcContinuousWidth,
      .atten = __adcContinuousAtten,
    };
    err = adc_cali_create_scheme_line_fitting(&cali_config, &adc_handle[adc_unit].adc_cali_handle);
#else
    log_e("ADC Calibration scheme is not supported!");
    return false;
#endif
    if (err != ESP_OK) {
      log_e("adc_cali_create_scheme_x failed!");
      return false;
    }
  }

  for (int k = 0; k < pins_count; k++) {
    if (!perimanSetPinBus(pins[k], ESP32_BUS_TYPE_ADC_CONT, (void *)(adc_unit + 1), adc_unit, channel[k])) {
      log_e("perimanSetPinBus to ADC Continuous failed!");
      adcContinuousDetachBus((void *)(adc_unit + 1));
      return false;
    }
  }

