espressif/arduino-esp32/cores/esp32/esp32-hal-adc.c
  return true;
}

bool analogContinuousRead(adc_continuous_result_t **buffer, uint32_t timeout_ms) {
  if (adc_handle[ADC_UNIT_1].adc_continuous_handle != NULL) {
    uint32_t bytes_read = 0;
    uint32_t read_raw[used_adc_channels];
    uint32_t read_count[used_adc_channels];

    size_t buffer_size = adc_handle[ADC_UNIT_1].conversion_frame_size;
    uint8_t *adc_read = (uint8_t *)heap_caps_aligned_alloc(ESP_ARDUINO_DMA_BUF_ALIGN, buffer_size, MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL);
    if (adc_read == NULL) {
      log_e("Failed to allocate DMA buffer");
      *buffer = NULL;
      return false;
    }

    memset(adc_read, 0xcc, buffer_size);
    memset(read_raw, 0, sizeof(read_raw));
    memset(read_count, 0, sizeof(read_count));

    esp_err_t err = adc_continuous_read(adc_handle[ADC_UNIT_1].adc_continuous_handle, adc_read, adc_handle[0].conversion_frame_size, &bytes_read, timeout_ms);
    if (err != ESP_OK) {
      if (err == ESP_ERR_TIMEOUT) {
        log_e("Reading data failed: No data, increase timeout");
      } else {
        log_e("Reading data failed with error: %X", err);
      }
      free(adc_read);
      adc_read = NULL;
      *buffer = NULL;
      return false;
    }

    for (int i = 0; i < bytes_read; i += SOC_ADC_DIGI_RESULT_BYTES) {
      adc_digi_output_data_t *p = (adc_digi_output_data_t *)&adc_read[i];
      uint32_t chan_num = ADC_GET_CHANNEL(p);
      uint32_t data = ADC_GET_DATA(p);

      /* Check the channel number validation, the data is invalid if the channel num exceed the maximum channel */
      if (chan_num >= SOC_ADC_CHANNEL_NUM(0)) {
        log_e("Invalid data [%" PRIu32 "_%" PRIu32 "]", chan_num, data);
        *buffer = NULL;
        return false;
      }
      if (data >= (1 << SOC_ADC_DIGI_MAX_BITWIDTH)) {
        data = 0;
        log_e("Invalid data");
      }

      for (int j = 0; j < used_adc_channels; j++) {
        if (adc_result[j].channel == chan_num) {
          read_raw[j] += data;
          read_count[j] += 1;
          break;
        }
      }
    }

    for (int j = 0; j < used_adc_channels; j++) {
      if (read_count[j] != 0) {
        adc_result[j].avg_read_raw = read_raw[j] / read_count[j];
        adc_cali_raw_to_voltage(adc_handle[ADC_UNIT_1].adc_cali_handle, adc_result[j].avg_read_raw, &adc_result[j].avg_read_mvolts);
      } else {
        log_w("No data read for pin %u", adc_result[j].pin);
      }
    }

    free(adc_read);
    adc_read = NULL;
    *buffer = adc_result;
    return true;

  } else {
    log_e("ADC Continuous is not initialized!");
    return false;
  }
}

bool analogContinuousStart() {
  if (adc_handle[ADC_UNIT_1].adc_continuous_handle != NULL) {
    if (adc_continuous_start(adc_handle[ADC_UNIT_1].adc_continuous_handle) == ESP_OK) {
      return true;
    }
  } else {
    log_e("ADC Continuous is not initialized!");
  }
  return false;
}

bool analogContinuousStop() {
  if (adc_handle[ADC_UNIT_1].adc_continuous_handle != NULL) {
    if (adc_continuous_stop(adc_handle[ADC_UNIT_1].adc_continuous_handle) == ESP_OK) {
      return true;
    }
  } else {
    log_e("ADC Continuous is not initialized!");
  }
  return false;
}

bool analogContinuousDeinit() {
  if (adc_handle[ADC_UNIT_1].adc_continuous_handle == NULL) {
    log_i("ADC Continuous was not initialized");
    return true;
  }

  // Clear all used pins from peripheral manager
  // This will trigger adcContinuousDetachBus() callback which cleans up the ADC driver
  for (uint8_t channel = 0; channel < SOC_ADC_CHANNEL_NUM(ADC_UNIT_1); channel++) {
    int io_pin;
    adc_oneshot_channel_to_io(ADC_UNIT_1, channel, &io_pin);
    if (perimanGetPinBusType(io_pin) == ESP32_BUS_TYPE_ADC_CONT) {
      if (!perimanClearPinBus(io_pin)) {
        return false;
      }
    }
  }

  // Free the result buffer (callback doesn't do this)
  if (adc_result != NULL) {
    free(adc_result);
    adc_result = NULL;
  }

  return true;
}

void analogContinuousSetAtten(adc_attenuation_t attenuation) {
  __adcContinuousAtten = attenuation;
}

void analogContinuousSetWidth(uint8_t bits) {
  if ((bits < SOC_ADC_DIGI_MIN_BITWIDTH) || (bits > SOC_ADC_DIGI_MAX_BITWIDTH)) {
    log_e("Selected width cannot be set. Range is from %u to %u", SOC_ADC_DIGI_MIN_BITWIDTH, SOC_ADC_DIGI_MAX_BITWIDTH);
    return;
  }
  __adcContinuousWidth = bits;
}

#endif
